# Ultralytics 🚀 AGPL-3.0 License
# YOLO11n crack-edge enhanced model - 2 EDGE MODULES

nc: 80

scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]                  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]                 # 1-P2/4
  - [-1, 2, C3k2_FMConv, [256, False, 0.25]]   # 2
  - [-1, 1, EdgeMambaOut, [64, 7, 4, 0.0]]     # 3 ★ shallow edge scan

  - [-1, 1, Conv, [256, 3, 2]]                 # 4-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]          # 5

  - [-1, 1, Conv, [512, 3, 2]]                 # 6-P4/16
  - [-1, 2, C3k2, [512, True]]                 # 7

  - [-1, 1, Conv, [1024, 3, 2]]                # 8-P5/32
  - [-1, 2, C3k2_FMConv, [1024, True]]         # 9
  - [-1, 1, SPPF, [1024, 5]]                   # 10
  - [-1, 2, C2PSA, [1024]]                     # 11
  - [-1, 1, EdgeMambaOut, [256, 7, 4, 0.0]]    # 12 ★ deep edge scan

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 13
  - [[-1, 7], 1, Concat, [1]]                  # 14 cat backbone P4
  - [-1, 2, C3k2_FMConv, [512, False]]          # 15

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 16
  - [[-1, 5], 1, Concat, [1]]                  # 17 cat backbone P3
  - [-1, 2, C3k2_FMConv, [256, False]]          # 18 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                 # 19
  - [[-1, 15], 1, Concat, [1]]                 # 20 cat head P4
  - [-1, 2, C3k2_FMConv, [512, False]]          # 21 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                 # 22
  - [[-1, 12], 1, Concat, [1]]                 # 23 cat backbone P5(edge-enhanced)
  - [-1, 2, C3k2_FMConv, [1024, True]]          # 24 (P5/32-large)

  - [[18, 21, 24], 1, Detect, [nc]]            # 25 Detect(P3, P4, P5)

